labs/realistic/latency/reports/adaptive-bulkread-4k16k-20260528T223502Z/singbox-bw-fast-tcp-16k-ka-20260528T223650Z.hey.txt

Summary:
  Total:	30.0008 secs
  Slowest:	0.0106 secs
  Fastest:	0.0002 secs
  Average:	0.0018 secs
  Requests/sec:	17840.3231
  
  Total data:	8769110016 bytes
  Size/request:	16384 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [76801]	|■■■■■■■■
  0.002 [376076]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [75249]	|■■■■■■■■
  0.004 [6101]	|■
  0.005 [753]	|
  0.006 [162]	|
  0.008 [40]	|
  0.009 [11]	|
  0.010 [13]	|
  0.011 [17]	|


Latency distribution:
  10%% in 0.0012 secs
  25%% in 0.0014 secs
  50%% in 0.0017 secs
  75%% in 0.0021 secs
  90%% in 0.0025 secs
  95%% in 0.0028 secs
  99%% in 0.0035 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0044 secs
  resp wait:	0.0017 secs, 0.0002 secs, 0.0089 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0071 secs

Status code distribution:
  [200]	535224 responses