labs/realistic/latency/reports/adaptive-bulkread-4k16k-20260528T223502Z/singbox-bw-fast-tcp-4k-ka-20260528T223538Z.hey.txt

Summary:
  Total:	30.0018 secs
  Slowest:	0.0127 secs
  Fastest:	0.0002 secs
  Average:	0.0019 secs
  Requests/sec:	16610.4821
  
  Total data:	2041217024 bytes
  Size/request:	4096 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [107585]	|■■■■■■■■■■■■
  0.003 [347406]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [40525]	|■■■■■
  0.005 [2475]	|
  0.006 [276]	|
  0.008 [50]	|
  0.009 [6]	|
  0.010 [6]	|
  0.011 [9]	|
  0.013 [5]	|


Latency distribution:
  10%% in 0.0012 secs
  25%% in 0.0015 secs
  50%% in 0.0019 secs
  75%% in 0.0023 secs
  90%% in 0.0027 secs
  95%% in 0.0030 secs
  99%% in 0.0037 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0068 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0041 secs
  resp wait:	0.0019 secs, 0.0002 secs, 0.0076 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [200]	498344 responses