labs/realistic/latency/reports/adaptive-bulkread-4k16k-20260528T223502Z/singbox-singbox-tcp-16k-ka-20260528T223614Z.hey.txt

Summary:
  Total:	30.0014 secs
  Slowest:	0.0147 secs
  Fastest:	0.0003 secs
  Average:	0.0022 secs
  Requests/sec:	14651.5195
  
  Total data:	7201849344 bytes
  Size/request:	16384 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [103529]	|■■■■■■■■■■■■■■
  0.003 [299567]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [34119]	|■■■■■
  0.006 [2151]	|
  0.007 [155]	|
  0.009 [11]	|
  0.010 [22]	|
  0.012 [10]	|
  0.013 [0]	|
  0.015 [1]	|


Latency distribution:
  10%% in 0.0014 secs
  25%% in 0.0017 secs
  50%% in 0.0021 secs
  75%% in 0.0026 secs
  90%% in 0.0031 secs
  95%% in 0.0034 secs
  99%% in 0.0043 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0032 secs
  resp wait:	0.0021 secs, 0.0002 secs, 0.0083 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [200]	439566 responses