labs/realistic/latency/reports/adaptive-bulkread-4k16k-20260528T223502Z/singbox-singbox-tcp-4k-ka-20260528T223502Z.hey.txt

Summary:
  Total:	30.0032 secs
  Slowest:	0.0121 secs
  Fastest:	0.0002 secs
  Average:	0.0019 secs
  Requests/sec:	16588.0815
  
  Total data:	2038558720 bytes
  Size/request:	4096 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [91733]	|■■■■■■■■■■■
  0.003 [337657]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [63099]	|■■■■■■■
  0.005 [4644]	|■
  0.006 [464]	|
  0.007 [64]	|
  0.009 [9]	|
  0.010 [15]	|
  0.011 [3]	|
  0.012 [6]	|


Latency distribution:
  10%% in 0.0012 secs
  25%% in 0.0015 secs
  50%% in 0.0019 secs
  75%% in 0.0023 secs
  90%% in 0.0027 secs
  95%% in 0.0030 secs
  99%% in 0.0038 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0062 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0038 secs
  resp wait:	0.0019 secs, 0.0002 secs, 0.0073 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [200]	497695 responses